const scriptBox = document.getElementById("scriptBox");
const optionsBox = document.getElementById("options");

function renderStep(text, options) {
    scriptBox.innerText = text;
    optionsBox.innerHTML = "";
    for (let label in options) {
        const btn = document.createElement("button");
        btn.textContent = label;
        btn.onclick = options[label];
        optionsBox.appendChild(btn);
    }
}

function startScript() {
    renderStep(`
    Добрий день, [ім’я клієнта]! 
    Мене звати [ім’я менеджера], я менеджер міжнародної онлайн-школи Expert X. 
    Ви залишали заявку на навчання з психології, так?`, {
        "Так, залишала": step2,
        "Ні, не пам’ятаю": endScript
    });
}

function step2() {
    renderStep(` 
        Чудово! Тоді пропоную такий план розмови: 
        Я коротко розповім про нашу школу.
        А для того, щоб я могла підібрати найкращий варіант 
        по навчанню саме для Вас, 
        я задам декілька питань, добре?`, {
        "Так, звісно": interestArea,
        "У мене немає часу": noTime
    });
}

function noTime() {
    renderStep(`
        Розумію, [ім’я клієнта]. 
        Я обов’язково надішлю інформацію в месенджер. 
        Але дуже прошу — приділіть ще буквально хвилину, щоб я підібрала найкращу програму. 
        Домовились?`, {
        "Добре, слухаю": interestArea,
        "Потім": endScript
    });
}

function interestArea() {
    renderStep(`
        Ви шукаєте навчання для себе чи для когось із близьких?
        Чи мали ви раніше досвід вивчення психології? Що тоді вас зацікавило?
        Чому вирішили повернутися до теми психології саме зараз?
        Ви розглядаєте курс для особистого розвитку чи для підвищення кваліфікації?
        Що для вас особливо важливо в навчанні?
        Підкажіть, чому саме зацікавились напрямком ( напрямок)?
        Коментуємо та приєднуємось до відповідей клієнта за допомогою комплімента. 
        
        Задаємо уточнюючі запитання, щоб краще зрозуміти запит клієнта. 
        Як плануєте застосовувати отримані знання та розкажіть будь ласка про свій досвід у цій сфері?
        Що є важливими аспектами для вас в виборі навчання?
        Чи проходили вже якісь навчання, що сподобалось а що ні, якщо не секрет?`, {
        "Дитяча психологія": kidsOnly,
        "Сім’я / Відносини": baseOnly,
        "Військова психологія": militaryOnly,
        "Саморозвиток": forHer,
        "Психологія «Психологія особистого та інтимного життя»": forHer,
        "BLACK PREMIUM (17 курсів)": blackPremiumBase,
        "BLACK EXPERT (23 курси)": blackExpert,
        "BLACK VIP (32 курси)": blackVIP
    });
}
function kids() {
    renderStep(`ДИТЯЧА ПСИХОЛОГІЯ "БАЗА" (3 КУРСИ)
        •	ДИТЯЧА ПСИХОЛОГІЯ
        •	ДИТЯЧА ПСИХОСОМАТИКА
        •	ПСИХОЛОГІЯ ЕМОЦІЙ
        Зараз 7 100 грн замість 10 200 грн`, {
            " ПАКЕТИ " : pakeg,
            "Дитяча психологія БАЗА (3 курси)": kids,
            "KIDS (7 курсів)": kidsOnly,
            "Дитячий психолог (9 курсів)": kidspsychologist,
            "Дитячий психолог під ключ": kidsPsychodogTurnkey,
            "Так": confirmEnroll,
            "Пізніше": endScript
    });
}
function kidspsychologist(){
    renderStep(`ДИТЯЧИЙ ПСИХОЛОГ (9 КУРСІВ)
        •	ДИТЯЧА ПСИХОЛОГІЯ
        •	ДИТЯЧА ПСИХОСОМАТИКА
        •	АРТ-ТЕРАПІЯ
        •	ПЕРИНАТАЛЬНА ПСИХОЛОГІЯ
        •	ПСИХОЛОГ ДОШКІЛЬНИХ ЗАКЛАДІВ
        •	СІМЕЙНА ПСИХОЛОГІЯ
        •	ПСИХОЛОГІЯ ЕМОЦІЙ
        •	ПСИХОТРАВМИ
        •	ПСИХОЛОГІЯ ДІТЕЙ З ОСОБЛИВОСТЯМИ РОЗВИТКУ. BASIC
        
        + У ПОДАРУНОК "МЕДИТАЦІЇ НА КОЖЕН ДЕНЬ"
        ДОДАТКОВО ДО НАВЧАННЯ:
        •	ПРАКТИЧНЕ ВІДПРАЦЮВАННЯ ПРОГРАМИ З ПІДТРИМКОЮ ЕКСПЕРТА
        •	ДОМАШНІ ЗАВДАННЯ З ПЕРЕВІРКОЮ
        •	ДИПЛОМ/СЕРТИФІКАТИ ISO
        
        16400 ГРН замість 32780 грн`, {
            " ПАКЕТИ " : pakeg,
        "Дитяча психологія БАЗА (3 курси)": kids,
        "KIDS (7 курсів)": kidsOnly,
        "Дитячий психолог (9 курсів)": kidspsychologist,
        "Дитячий психолог під ключ": kidsPsychodogTurnkey,
        "Так": confirmEnroll,
        "Пізніше": endScript
    });
}

function kidsOnly() {
    renderStep(`Маю для вас важливий напрям — “Дитяча психологія”. Цей пакет розроблений спеціально для тих, хто хоче працювати з дітьми, 
        батьками та освітнім середовищем. У складі — 7 глибоких курсів.
        Ви отримаєте:
        •	Розуміння вікової психології
        •	Інструменти для роботи з поведінкою, тривожністю, адаптацією
        •	Техніки арт- і казкотерапії
        •	Сертифікати та приклади роботи з дітьми
        Курси в пакеті:
        •	Дитяча психологія
        •	Арт-терапія
        •	Перинатальна психологія
        •	Психолог дошкільних закладів
        •	Логопедія
        •	Логопедичне тейпування
        •	Дитяча психосаматика
        Якщо вам цікаво — можу розповісти більше або скинути приклади матеріалів.`, {
            " ПАКЕТИ " : pakeg,
            "Дитяча психологія БАЗА (3 курси)": kids,
            "KIDS (7 курсів)": kidsOnly,
            "Дитячий психолог (9 курсів)": kidspsychologist,
            "Дитячий психолог під ключ": kidsPsychodogTurnkey,
            "Так": confirmEnroll,
            "Пізніше": endScript
    });
}
function kidsPsychodogTurnkey(){
    renderStep(`ДИТЯЧИЙ ПСИХОЛОГ ПІД КЛЮЧ (15 КУРСІВ)
        ДИТЯЧА ПСИХОЛОГІЯ
        ДИТЯЧА ПСИХОСОМАТИКА
        ПСИХОЛОГІЯ РОЗВИТКУ
        АРТ-ТЕРАПІЯ
        ПЕРИНАТАЛЬНА ПСИХОЛОГІЯ
        ПСИХОЛОГ ДОШКІЛЬНИХ ЗАКЛАДІВ
        СІМЕЙНА ПСИХОЛОГІЯ
        ПСИХОЛОГІЯ ЕМОЦІЙ
        ПСИХОТРАВМИ
        ЛОГОПЕДІЯ: БАЗОВИЙ РІВЕНЬ
        ЛОГОПЕДІЯ PRO
        ПОЧАТОК ПРАКТИКИ ПСИХОЛОГА
        ЛОГОПЕДИЧНЕ ТЕЙПУВАННЯ
        ПСИХОЛОГІЯ ДІТЕЙ З ОСОБЛИВОСТЯМИ РОЗВИТКУ. BASIC
        ПСИХОЛОГІЯ ДІТЕЙ З ОСОБЛИВОСТЯМИ РОЗВИТКУ. PRO
        + У ПОДАРУНОК Т "МЕДИТАЦІЇ НА КОЖЕН ДЕНЬ"
        + У ПОДАРУНОК ЧЕК ЛИСТ «ДИТЯЧИЙ ПСИХОЛОГ. ЯК ВСТАНОВИТИ КОНТАКТ З ДИТИНОЮ ТА ЗРОБИТИ ТАК АБИ
        ВОНА ВАМ ДОВІРЯЛА. ПРАВИЛА ПЕРШОГО ПРИЙОМУ»
        Додатково до навчання:
        • 12 МІСЯЦІВ НАВЧАННЯ З СУПРОВОДОМ ОСОБИСТОГО КОУЧА
        • 6 ІНДИВІДУАЛЬНИХ ОНЛАЙН ЗУСТРІЧЕЙ 3НАСТАВНИКАМИ ЗА ТЕМАМИ НАВЧАННЯ(ПИТАННЯ, ДОПОМОГА, РОЗБІР)
        • ПРАКТИЧНЕ ВІДПРАЦЮВАННЯ ПРОГРАМИ З ПІДТРИМКОЮ ЕКСПЕРТА 
        • ДОМАШНІ ЗАВДАННЯ З ПЕРЕВІРКОЮ + ФІДБЕК
        • БЕЗЛІМІТНИЙ ДОСТУП ДО НАВЧАННЯ
        • ІНДИВІДУАЛЬНЕ ОПРАЦЮВАННЯ КЕЙСУ КЛІЄНТА (РЕАЛЬНА ПРАКТИКА ВЕДЕННЯ ПЕРШИХ КОНСУЛЬТАЦІЙ)
        • ДОПОМОГА В УПАКОВЦІ ОСОБИСТОГО БРЕНДУ В INSTAGRAM
        • РЕКЛАМА НА СТОРІНЦІ EXPERT, ЯК ФАХІВЦЯ
        • ОСОБИСТИЙ КАЛЕНДАР НАВЧАННЯ
        • СУПЕРВІЗІЯ
        • ОРИГІНАЛЬНИЙ ДИПЛОМ BLACK Х
        • ЛЕКЦІЇ ВІД КНЕУ
        • СЕРТИФІКАЦІЯ ВІД МОН ПРО ПІДВИЩЕННЯ КВАЛІФІКАЦІЇ (5 КРЕДИТІВ) 150 академічних годин
        + ЩОДЕННИК EXPERT У ПОДАРУНОК`, {
            " ПАКЕТИ " : pakeg,
            "Дитяча психологія БАЗА (3 курси)": kids,
            "KIDS (7 курсів)": kidsOnly,
            "Дитячий психолог (9 курсів)": kidspsychologist,
            "Дитячий психолог під ключ": kidsPsychodogTurnkey,
            "Так": confirmEnroll,
            "Пізніше": endScript
        
    });
}
function pakeg() {
    renderStep(``,{
        "Дитяча психологія": kidsOnly,
        "Сім’я / Відносини": baseOnly,
        "Військова психологія": militaryOnly,
        "Саморозвиток": forHer,
        "Психологія «Психологія особистого та інтимного життя»": forHer,
        "BLACK PREMIUM (17 курсів)": blackPremiumBase,
        "BLACK EXPERT (23 курси)": blackExpert,
        "BLACK VIP (32 курси)": blackVIP
    });
}

function baseOnly() {
    renderStep(`Хочу розповісти вам про один з наших спеціалізованих напрямів — 
        «Психологія. Я. Відносини. Сім’я». Це комплекс з 4 курсів, спрямований на глибоке розуміння міжособистісних 
        відносин та роботу з парами і сім’ями.
        Ви отримаєте:
        •	Розуміння конфліктної динаміки у стосунках
        •	Навички терапії в парі
        10100 грн Замість 16300 грн
        • Практична психологія:Базовий курс
        • Сімейна психологія
        • Психологія відносин
        • Психосоматика доросла`,{
            " ПАКЕТИ " : pakeg,
            "Так": confirmEnroll,
            "Пізніше": endScript,
            " ПАКЕТИ " : pakeg
    });
}

function blackPremiumBase() {
    renderStep(`🎓 BLACK PREMIUM "ЕКСПЕРТ З ПСИХОЛОГІЇ " (17 курсів)
        
        📚 Перелік курсів
        •	Практична психологія: Базовий курс
        •	Початок практики психолога
        •	Сімейна психологія
        •	Психологія відносин
        •	Панічні атаки
        •	Клінічна психологія
        •	Гештальт-терапія
        •	Арт-терапія
        •	Психосоматика
        •	Дитяча психологія
        •	Тілесно-орієнтовна терапія
        •	Метафоричні асоціативні карти
        •	Психологія емоцій
        •	Психотравми
        •	Психологія розвитку
        •	НЛП
        •	Військова психологія
        •	ПРАКТИЧНЕ ВІДПРАЦЮВАННЯ ПРОГРАМИ PREMIUM З ПІДТРИМКОЮ
        ЕКСПЕРТА: ДОМАШНІ ЗАВДАННЯ З ПЕРЕВІРКОЮ, ЗВОРОТНИЙ ЗВʼЯЗОК
        •	ОНЛАЙН ЛЕКЦІЇ ВІД КНЕУ
        •	ДЕРЖАВНА СЕРТИФІКАЦІЯ МОН ВІД КНЕУ (6 КРЕДИТІВ)
        •	ОРИГІНАЛЬНИЙ ДИПЛОМ
        
        💸 Ціна зі знижкою – 22500 грн (замість 48700 грн)`, {
            " ПАКЕТИ " : pakeg,
            "Так": confirmEnroll,
            "Пізніше": endScript
    });
}
function blackExpert() {
    renderStep(`🎓 Психологія «Black Expert» – 23 курси / 200 годин / 12 ЄКТС
        
        А якщо ви розглядаєте варіант з більш широким охопленням тем — у нас є комплекс Black Expert.
        Це 23 курси, 200 годин навчання та 12 кредитів ЄКТС.

        Ви отримаєте:
        • Ширший обсяг тем (включно з практикою)
        • Сертифікат державного зразка на 12 кредитів
        • Підпис ректора, підтвердження про підвищення кваліфікації
        • Доступ на обмежений період
        • Оплата частинами доступна
        💸 Ціна зі знижкою – 47 800 грн (замість 62 450 грн)
        
        Цей пакет обирають ті, кому важливо отримати максимум тем.
        📚 Перелік курсів:
        • Практична психологія Базовий курс
        • НЛП
        • Початок практики психолога
        • Сімейна психологія
        • Психологія відносин
        • Панічні атаки
        • Клінічна психологія
        • Гештальт-терапія
        • Арт-терапія
        • Психосоматика
        • Дитяча психологія
        • Перинатальна психологія
        • Психолог дошкільних закладів
        • Дитяча психосоматика
        • Логопедія
        • Тілесно-орієнтовна терапія
        • Військова психологія
        • Метафоричні карти
        • Чоловіча психологія
        • Анатомія сексу
        • Сексологія
        • 10 медитацій
        • Психологія емоцій
        
        🧩 ДОДАТКОВО ДО BLACK EXPERT:
        • Супервізія
        • Практичне відпрацювання з підтримкою експерта
        • Домашні завдання з перевіркою
        • Онлайн лекції від КНЕУ
        • Сертифікація МОН (12 кредитів)
        • 12 місяців навчання з коучем
        • 8 групових практик
        • Перевірка ДЗ + фідбек
        • Індивідуальне опрацювання кейсів клієнтів
        • Диплом Black X
        • Допомога в упаковці особистого бренду 
        • Реклама як фахівця на сторінці Expert
        • Щоденник Expert у подарунок`, {
            " ПАКЕТИ " : pakeg,
        "Оформити": confirmEnroll,
        "Повернутися до вибору": militaryOnly
    });
}

function blackVIP() {
    renderStep(`🎓 Психологія «Black VIP» – 32 курси / 800 годин / 12 ЄКТС
        
        А якщо ви розглядаєте варіант з більш широким охопленням тем — у нас є комплекс Black VIP.
        Це 32 курси, 800 годин навчання та 12 кредитів ЄКТС.

        Ви отримаєте:
        • Ширший обсяг тем (включно з практикою)
        • Сертифікат державного зразка на 12 кредитів
        • Підпис ректора, підтвердження про підвищення кваліфікації
        • Доступ на обмежений період
        • Оплата частинами доступна
        💸 Ціна зі знижкою – 71 500 грн (замість 98 750 грн)
        
        Цей пакет обирають ті, кому важливо отримати максимум тем.
        📚 Перелік курсів:
        • Практична психологія Базовий курс
        • НЛП
        • Початок практики психолога
        • Сімейна психологія
        • Психологія відносин
        • Панічні атаки
        • Клінічна психологія
        • Гештальт-терапія
        • Арт-терапія
        • Психосоматика
        • Дитяча психологія
        • Перинатальна психологія
        • Психолог дошкільних закладів
        • Дитяча психосоматика
        • Логопедія
        • Тілесно-орієнтовна терапія
        • Військова психологія
        • Метафоричні карти
        • Чоловіча психологія
        • Анатомія сексу
        • Сексологія
        • 10 медитацій
        • Психологія емоцій
        +++++++ 
        • Сексологія 2.0
        • Психологія зради
        • PRO оргазм
        • Коучинг
        • Психологія харчування
        • Психотравми
        • Психологія розвитку
        • Позитивна психотерапія
        • Когнітивно-поведінкова терапія
        
        🧩 ДОДАТКОВО ДО BLACK VIP:
        • Супервізія
        • Практичне відпрацювання з підтримкою експерта
        • Домашні завдання з перевіркою
        • Онлайн лекції від КНЕУ
        • Сертифікація МОН (12 кредитів)
        • 12 місяців навчання з коучем
        • 8 групових практик
        • Перевірка ДЗ + фідбек
        • Безлімітний доступ до навчання
        • Індивідуальне опрацювання кейсів клієнтів
        • Диплом Black X
        • Допомога в упаковці особистого бренду
        • Реклама як фахівця на сторінці Expert
        • Щоденник Expert у подарунок
        
        8 ІНДИВІДУАЛЬНИХ ОНЛАЙН ЗУСТРІЧЕЙ З НАСТАВНИКАМИ ЗА ТЕМАМИ НАВЧАННЯ
        (ПИТАННЯ, ДОПОМОГА, РОЗБІР):
        • ПІДПИСКА EXPERT (BCI НОВІ КУРСИ )
        • ДИПЛОМНА РОБОТА`, {
            " ПАКЕТИ " : pakeg,
        "Оформити": confirmEnroll,
        "Повернутися до вибору": militaryOnly
    });
}

function militaryOnly() {
    renderStep(`ВІЙСЬКОВА ПСИХОЛОГІЯ: РОБОТА З БІЙЦЯМИ ТА ЇХНІМИ РОДИНАМИ (7 курсів)
        • Військова психологія
        • Практична психологія: Базовий курс
        • Психотравми
        • Психосоматика
        • Панічні атаки
        • Психологічна допомога під час реабілітації: техніки роботи з військовими та їх сімʼями
        • Когнітивно-поведінкова терапія
        + 2 групові ZOOM практики
        💸 Ціна зі знижкою – 19800 грн (замість 28190 грн)`, {
            " ПАКЕТИ " : pakeg,
        "Так": confirmEnroll,
        "Пізніше": endScript
    });
}

function forHer() {
    renderStep( `Хочу познайомити вас з делікатною, але надзвичайно актуальною темою — це «Психологія особистого та інтимного життя». Комплекс для тих, хто хоче працювати з темами сексуальності, тіла, самоприйняття.
        Ви отримаєте:
        • Глибокі знання у сфері психології стосунків, сексуальності, сорому, тілесності
        •	Техніки терапевтичної роботи з інтимними запитами
        •	Сертифікати за кожен курс
        •	Повноцінну спеціалізацію для консультування
        📚 Перелік курсів:
        •	Анатомія сексу
        •	Сексологія
        •	Сексологія 2.0
        •	Марафон сексуальності
        •	Психологія зради
        •	PRO оргазм
        •	Чоловіча психологія
        •	Психологія відносин
        💸 Ціна зі знижкою – 6 490 грн (замість 18 150 грн)`, {
            " ПАКЕТИ " : pakeg,
            "Так": confirmEnroll,
    });
}



function confirmEnroll() {
    renderStep("Чудово! Я надішлю вам всі деталі для початку навчання.", {});
}

function endScript() {
    renderStep("Підкажіть, будь ласка, коли вам зручно буде поспілкуватися? Бажаю вам гарного дня!", {});
}

startScript();
